output/erd/schema.dbml
// Generated by ER Visualization Engine (ERVE)
// Source: F:\agentic_profiler\new\output\relationships\relationships.json
// Generated: 2026-05-20T17:19:20

Project ERVE_Schema {
  database_type: "Generic"
  Note: "Generated from relationship.json with min confidence 0.7"
}

// Module: application
Table application_deliverymethods {
  deliverymethodid int [pk]
  deliverymethodname varchar
  lasteditedby int
  validfrom timestamp
  validto timestamp
}

Table application_transactiontypes {
  transactiontypeid int [pk]
  transactiontypename varchar
  lasteditedby int
  validfrom timestamp
  validto timestamp
}

Table Application_StateProvinces {
  stateprovinceid int [pk]
  stateprovincecode varchar
  stateprovincename varchar
  countryid int
  salesterritory varchar
  border varchar
  latestrecordedpopulation int
  lasteditedby int
  validfrom timestamp
  validto timestamp
}

Table Application_Cities {
  cityid int [pk]
  cityname varchar
  stateprovinceid int
  location varchar
  latestrecordedpopulation float
  lasteditedby int
  validfrom timestamp
  validto timestamp
}

Table Application_Countries {
  countryid int [pk]
  countryname varchar
  formalname varchar
  isoalpha3code varchar
  isonumericcode int
  countrytype varchar
  latestrecordedpopulation int
  continent varchar
  region varchar
  subregion varchar
  border varchar
  lasteditedby int
  validfrom timestamp
  validto timestamp
}

Table application_paymentmethods {
  paymentmethodid int [pk]
  paymentmethodname varchar
  lasteditedby int
  validfrom timestamp
  validto timestamp
}

Table application_people {
  personid int [pk]
  fullname varchar
  preferredname varchar
  searchname varchar
  ispermittedtologon boolean
  logonname varchar
  isexternallogonprovider boolean
  hashedpassword varchar
  issystemuser boolean
  isemployee boolean
  issalesperson boolean
  userpreferences varchar
  phonenumber varchar
  faxnumber varchar
  emailaddress varchar
  photo varchar
  customfields varchar
  otherlanguages varchar
  lasteditedby int
  validfrom timestamp
  validto timestamp
}

Table Application_SystemParameters {
  systemparameterid boolean [pk]
  deliveryaddressline1 varchar
  deliveryaddressline2 varchar
  deliverycityid int
  deliverypostalcode int
  deliverylocation varchar
  postaladdressline1 varchar
  postaladdressline2 varchar
  postalcityid int
  postalpostalcode int
  lasteditedby int
  lasteditedwhen timestamp
}

// Module: purchasing
Table purchasing_suppliertransactions {
  suppliertransactionid int [pk]
  supplierid int
  transactiontypeid int
  purchaseorderid int
  paymentmethodid int
  supplierinvoicenumber float
  transactiondate timestamp
  amountexcludingtax float
  taxamount float
  transactionamount float
  outstandingbalance float
  finalizationdate timestamp
  isfinalized boolean
  lasteditedby int
  lasteditedwhen timestamp
}

Table purchasing_purchaseorders {
  purchaseorderid int [pk]
  supplierid int
  orderdate timestamp
  deliverymethodid int
  contactpersonid int
  expecteddeliverydate timestamp
  supplierreference varchar
  isorderfinalized boolean
  comments varchar
  internalcomments varchar
  lasteditedby int
  lasteditedwhen timestamp
}

Table Purchasing_Suppliers {
  supplierid int [pk]
  suppliername varchar
  suppliercategoryid int
  primarycontactpersonid int
  alternatecontactpersonid int
  deliverymethodid int
  deliverycityid int
  postalcityid int
  supplierreference varchar
  bankaccountname varchar
  bankaccountbranch varchar
  bankaccountcode int
  bankaccountnumber int
  bankinternationalcode int
  paymentdays int
  internalcomments varchar
  phonenumber varchar
  faxnumber varchar
  websiteurl varchar
  deliveryaddressline1 varchar
  deliveryaddressline2 varchar
  deliverypostalcode int
  deliverylocation varchar
  postaladdressline1 varchar
  postaladdressline2 varchar
  postalpostalcode int
  lasteditedby int
  validfrom timestamp
  validto timestamp
}

Table purchasing_suppliercategories {
  suppliercategoryid int [pk]
  suppliercategoryname varchar
  lasteditedby int
  validfrom timestamp
  validto timestamp
}

Table purchasing_purchaseorderlines {
  purchaseorderlineid int [pk]
  purchaseorderid int [pk]
  stockitemid int
  orderedouters int
  description varchar
  receivedouters int
  packagetypeid int
  expectedunitpriceperouter float
  lastreceiptdate timestamp
  isorderlinefinalized boolean
  lasteditedby int
  lasteditedwhen timestamp
  "purchaseorderid,stockitemid,packagetypeid" varchar
  "purchaseorderid,purchaseorderlineid" varchar
}

// Module: sales
Table Sales_Customers {
  customerid int [pk]
  customername varchar
  billtocustomerid int
  customercategoryid int
  buyinggroupid int
  primarycontactpersonid int
  alternatecontactpersonid int
  deliverymethodid int
  deliverycityid int
  postalcityid int
  creditlimit float
  accountopeneddate timestamp
  standarddiscountpercentage float
  isstatementsent boolean
  isoncredithold boolean
  paymentdays int
  phonenumber varchar
  faxnumber varchar
  deliveryrun varchar
  runposition varchar
  websiteurl varchar
  deliveryaddressline1 varchar
  deliveryaddressline2 varchar
  deliverypostalcode int
  deliverylocation varchar
  postaladdressline1 varchar
  postaladdressline2 varchar
  postalpostalcode int
  lasteditedby int
  validfrom timestamp
  validto timestamp
}

Table sales_invoices {
  invoiceid int [pk]
  customerid int
  billtocustomerid int
  orderid int
  deliverymethodid int
  contactpersonid int
  accountspersonid int
  salespersonpersonid int
  packedbypersonid int
  invoicedate timestamp
  customerpurchaseordernumber int
  iscreditnote boolean
  creditnotereason varchar
  comments varchar
  deliveryinstructions varchar
  internalcomments varchar
  totaldryitems int
  totalchilleritems int
  deliveryrun varchar
  runposition varchar
  returneddeliverydata varchar
  confirmeddeliverytime timestamp
  confirmedreceivedby varchar
  lasteditedby int
  lasteditedwhen timestamp
}

Table sales_customertransactions {
  customertransactionid int [pk]
  customerid int
  transactiontypeid int
  invoiceid int
  paymentmethodid int
  transactiondate timestamp
  amountexcludingtax float
  taxamount float
  transactionamount float
  outstandingbalance float
  finalizationdate timestamp
  isfinalized boolean
  lasteditedby int
  lasteditedwhen timestamp
}

Table sales_specialdeals {
  specialdealid int [pk]
  stockitemid varchar
  customerid varchar
  buyinggroupid int
  customercategoryid varchar
  stockgroupid int
  dealdescription varchar
  startdate timestamp
  enddate timestamp
  discountamount varchar
  discountpercentage float
  unitprice varchar
  lasteditedby int
  lasteditedwhen timestamp
}

Table sales_buyinggroups {
  buyinggroupid int [pk]
  buyinggroupname varchar
  lasteditedby int
  validfrom timestamp
  validto timestamp
}

Table sales_customercategories {
  customercategoryid int [pk]
  customercategoryname varchar
  lasteditedby int
  validfrom timestamp
  validto timestamp
}

Table sales_invoicelines {
  invoicelineid int [pk]
  invoiceid int [pk]
  stockitemid int
  description varchar
  packagetypeid int
  quantity int
  unitprice float
  taxrate float
  taxamount float
  lineprofit float
  extendedprice float
  lasteditedby int
  lasteditedwhen timestamp
  "invoiceid,stockitemid,packagetypeid" varchar
  "invoiceid,invoicelineid" varchar
}

Table sales_orders {
  orderid int [pk]
  customerid int
  salespersonpersonid int
  pickedbypersonid int
  contactpersonid int
  backorderorderid int
  orderdate timestamp
  expecteddeliverydate timestamp
  customerpurchaseordernumber int
  isundersupplybackordered boolean
  comments varchar
  deliveryinstructions varchar
  internalcomments varchar
  pickingcompletedwhen timestamp
  lasteditedby int
  lasteditedwhen timestamp
}

Table Sales_OrderLines {
  orderlineid int [pk]
  orderid int [pk]
  stockitemid int
  description varchar
  packagetypeid int
  quantity int
  unitprice float
  taxrate float
  pickedquantity int
  pickingcompletedwhen timestamp
  lasteditedby int
  lasteditedwhen timestamp
  "orderid,stockitemid,packagetypeid" varchar
  "orderid,orderlineid" varchar
}

// Module: warehouse
Table warehouse_stockitems {
  stockitemid int [pk]
  stockitemname varchar
  supplierid int
  colorid int
  unitpackageid int
  outerpackageid int
  brand varchar
  size varchar
  leadtimedays int
  quantityperouter int
  ischillerstock boolean
  barcode int
  taxrate float
  unitprice float
  recommendedretailprice float
  typicalweightperunit float
  marketingcomments varchar
  internalcomments varchar
  photo varchar
  customfields varchar
  tags varchar
  searchdetails varchar
  lasteditedby int
  validfrom timestamp
  validto timestamp
}

Table warehouse_packagetypes {
  packagetypeid int [pk]
  packagetypename varchar
  lasteditedby int
  validfrom timestamp
  validto timestamp
}

Table warehouse_stockgroups {
  stockgroupid int [pk]
  stockgroupname varchar
  lasteditedby int
  validfrom timestamp
  validto timestamp
}

Table warehouse_coldroomtemperatures {
  coldroomtemperatureid int [pk]
  coldroomsensornumber int
  recordedwhen timestamp
  temperature float
  validfrom timestamp
  validto timestamp
}

Table warehouse_colors {
  colorid int [pk]
  colorname varchar
  lasteditedby int
  validfrom timestamp
  validto timestamp
}

Table warehouse_stockitemstockgroups {
  stockitemstockgroupid int [pk]
  stockitemid int [pk]
  stockgroupid int [pk]
  lasteditedby int
  lasteditedwhen varchar
  "stockitemid,stockgroupid" varchar
}

Table warehouse_stockitemtransactions {
  stockitemtransactionid int [pk]
  stockitemid int
  transactiontypeid int
  customerid int
  invoiceid int
  supplierid int
  purchaseorderid int
  transactionoccurredwhen timestamp
  quantity float
  lasteditedby int
  lasteditedwhen timestamp
}

Table warehouse_stockitemholdings {
  stockitemid int
  quantityonhand int
  binlocation varchar
  laststocktakequantity int
  lastcostprice float
  reorderlevel int
  targetstocklevel int
  lasteditedby int
  lasteditedwhen varchar
}

Table warehouse_vehicletemperatures {
  vehicletemperatureid int [pk]
  vehicleregistration varchar
  chillersensornumber int
  recordedwhen timestamp
  temperature float
  fullsensordata varchar
  iscompressed boolean
  compressedsensordata varchar
}

Ref: Application_Cities.stateprovinceid > Application_StateProvinces.stateprovinceid
Ref: Application_StateProvinces.countryid > Application_Countries.countryid
Ref: purchasing_purchaseorderlines.packagetypeid > warehouse_packagetypes.packagetypeid
Ref: purchasing_purchaseorderlines.stockitemid > warehouse_stockitems.stockitemid
Ref: purchasing_purchaseorders.deliverymethodid > application_deliverymethods.deliverymethodid
Ref: purchasing_purchaseorders.supplierid > Purchasing_Suppliers.supplierid
Ref: Purchasing_Suppliers.suppliercategoryid > purchasing_suppliercategories.suppliercategoryid
Ref: purchasing_suppliertransactions.paymentmethodid > application_paymentmethods.paymentmethodid
Ref: purchasing_suppliertransactions.transactiontypeid > application_transactiontypes.transactiontypeid
Ref: purchasing_suppliertransactions.supplierid > Purchasing_Suppliers.supplierid
Ref: Sales_Customers.deliverymethodid > application_deliverymethods.deliverymethodid
Ref: Sales_Customers.customercategoryid > sales_customercategories.customercategoryid
Ref: sales_customertransactions.transactiontypeid > application_transactiontypes.transactiontypeid
Ref: sales_customertransactions.customerid > Sales_Customers.customerid
Ref: sales_invoicelines.invoiceid > sales_invoices.invoiceid
Ref: sales_invoicelines.packagetypeid > warehouse_packagetypes.packagetypeid
Ref: sales_invoicelines.stockitemid > warehouse_stockitems.stockitemid
Ref: sales_invoices.deliverymethodid > application_deliverymethods.deliverymethodid
Ref: sales_invoices.customerid > Sales_Customers.customerid
Ref: Sales_OrderLines.packagetypeid > warehouse_packagetypes.packagetypeid
Ref: Sales_OrderLines.stockitemid > warehouse_stockitems.stockitemid
Ref: sales_orders.customerid > Sales_Customers.customerid
Ref: sales_specialdeals.buyinggroupid > sales_buyinggroups.buyinggroupid
Ref: sales_specialdeals.stockgroupid > warehouse_stockgroups.stockgroupid
Ref: warehouse_stockitemholdings.stockitemid > warehouse_stockitems.stockitemid
Ref: warehouse_stockitems.supplierid > Purchasing_Suppliers.supplierid
Ref: warehouse_stockitemstockgroups.stockgroupid > warehouse_stockgroups.stockgroupid
Ref: warehouse_stockitemstockgroups.stockitemid > warehouse_stockitems.stockitemid
Ref: warehouse_stockitemtransactions.transactiontypeid > application_transactiontypes.transactiontypeid
Ref: warehouse_stockitemtransactions.stockitemid > warehouse_stockitems.stockitemid
