output/erd/schema.mmd
erDiagram
    %% Generated by ERVE from F:\agentic_profiler\new\output\relationships\relationships.json
    %% min_confidence=0.7
    %% Module: application
    APPLICATION_DELIVERYMETHODS {
        int deliverymethodid PK
        string deliverymethodname
        int lasteditedby
        datetime validfrom
        datetime validto
    }
    APPLICATION_TRANSACTIONTYPES {
        int transactiontypeid PK
        string transactiontypename
        int lasteditedby
        datetime validfrom
        datetime validto
    }
    APPLICATION_STATEPROVINCES {
        int stateprovinceid PK
        string stateprovincecode
        string stateprovincename
        int countryid
        string salesterritory
        string border
        int latestrecordedpopulation
        int lasteditedby
        datetime validfrom
        datetime validto
    }
    APPLICATION_CITIES {
        int cityid PK
        string cityname
        int stateprovinceid
        string location
        float latestrecordedpopulation
        int lasteditedby
        datetime validfrom
        datetime validto
    }
    APPLICATION_COUNTRIES {
        int countryid PK
        string countryname
        string formalname
        string isoalpha3code
        int isonumericcode
        string countrytype
        int latestrecordedpopulation
        string continent
        string region
        string subregion
        string border
        int lasteditedby
        datetime validfrom
        datetime validto
    }
    APPLICATION_PAYMENTMETHODS {
        int paymentmethodid PK
        string paymentmethodname
        int lasteditedby
        datetime validfrom
        datetime validto
    }
    APPLICATION_PEOPLE {
        int personid PK
        string fullname
        string preferredname
        string searchname
        boolean ispermittedtologon
        string logonname
        boolean isexternallogonprovider
        string hashedpassword
        boolean issystemuser
        boolean isemployee
        boolean issalesperson
        string userpreferences
        string phonenumber
        string faxnumber
        string emailaddress
        string photo
        string customfields
        string otherlanguages
        int lasteditedby
        datetime validfrom
        datetime validto
    }
    APPLICATION_SYSTEMPARAMETERS {
        boolean systemparameterid PK
        string deliveryaddressline1
        string deliveryaddressline2
        int deliverycityid
        int deliverypostalcode
        string deliverylocation
        string postaladdressline1
        string postaladdressline2
        int postalcityid
        int postalpostalcode
        int lasteditedby
        datetime lasteditedwhen
    }
    %% Module: purchasing
    PURCHASING_SUPPLIERTRANSACTIONS {
        int suppliertransactionid PK
        int supplierid
        int transactiontypeid
        int purchaseorderid
        int paymentmethodid
        float supplierinvoicenumber
        datetime transactiondate
        float amountexcludingtax
        float taxamount
        float transactionamount
        float outstandingbalance
        datetime finalizationdate
        boolean isfinalized
        int lasteditedby
        datetime lasteditedwhen
    }
    PURCHASING_PURCHASEORDERS {
        int purchaseorderid PK
        int supplierid
        datetime orderdate
        int deliverymethodid
        int contactpersonid
        datetime expecteddeliverydate
        string supplierreference
        boolean isorderfinalized
        string comments
        string internalcomments
        int lasteditedby
        datetime lasteditedwhen
    }
    PURCHASING_SUPPLIERS {
        int supplierid PK
        string suppliername
        int suppliercategoryid
        int primarycontactpersonid
        int alternatecontactpersonid
        int deliverymethodid
        int deliverycityid
        int postalcityid
        string supplierreference
        string bankaccountname
        string bankaccountbranch
        int bankaccountcode
        int bankaccountnumber
        int bankinternationalcode
        int paymentdays
        string internalcomments
        string phonenumber
        string faxnumber
        string websiteurl
        string deliveryaddressline1
        string deliveryaddressline2
        int deliverypostalcode
        string deliverylocation
        string postaladdressline1
        string postaladdressline2
        int postalpostalcode
        int lasteditedby
        datetime validfrom
        datetime validto
    }
    PURCHASING_SUPPLIERCATEGORIES {
        int suppliercategoryid PK
        string suppliercategoryname
        int lasteditedby
        datetime validfrom
        datetime validto
    }
    PURCHASING_PURCHASEORDERLINES {
        int purchaseorderlineid PK
        int purchaseorderid PK
        int stockitemid
        int orderedouters
        string description
        int receivedouters
        int packagetypeid
        float expectedunitpriceperouter
        datetime lastreceiptdate
        boolean isorderlinefinalized
        int lasteditedby
        datetime lasteditedwhen
        string purchaseorderid_stockitemid_packagetypeid
        string purchaseorderid_purchaseorderlineid
    }
    %% Module: sales
    SALES_CUSTOMERS {
        int customerid PK
        string customername
        int billtocustomerid
        int customercategoryid
        int buyinggroupid
        int primarycontactpersonid
        int alternatecontactpersonid
        int deliverymethodid
        int deliverycityid
        int postalcityid
        float creditlimit
        datetime accountopeneddate
        float standarddiscountpercentage
        boolean isstatementsent
        boolean isoncredithold
        int paymentdays
        string phonenumber
        string faxnumber
        string deliveryrun
        string runposition
        string websiteurl
        string deliveryaddressline1
        string deliveryaddressline2
        int deliverypostalcode
        string deliverylocation
        string postaladdressline1
        string postaladdressline2
        int postalpostalcode
        int lasteditedby
        datetime validfrom
        datetime validto
    }
    SALES_INVOICES {
        int invoiceid PK
        int customerid
        int billtocustomerid
        int orderid
        int deliverymethodid
        int contactpersonid
        int accountspersonid
        int salespersonpersonid
        int packedbypersonid
        datetime invoicedate
        int customerpurchaseordernumber
        boolean iscreditnote
        string creditnotereason
        string comments
        string deliveryinstructions
        string internalcomments
        int totaldryitems
        int totalchilleritems
        string deliveryrun
        string runposition
        string returneddeliverydata
        datetime confirmeddeliverytime
        string confirmedreceivedby
        int lasteditedby
        datetime lasteditedwhen
    }
    SALES_CUSTOMERTRANSACTIONS {
        int customertransactionid PK
        int customerid
        int transactiontypeid
        int invoiceid
        int paymentmethodid
        datetime transactiondate
        float amountexcludingtax
        float taxamount
        float transactionamount
        float outstandingbalance
        datetime finalizationdate
        boolean isfinalized
        int lasteditedby
        datetime lasteditedwhen
    }
    SALES_SPECIALDEALS {
        int specialdealid PK
        string stockitemid
        string customerid
        int buyinggroupid
        string customercategoryid
        int stockgroupid
        string dealdescription
        datetime startdate
        datetime enddate
        string discountamount
        float discountpercentage
        string unitprice
        int lasteditedby
        datetime lasteditedwhen
    }
    SALES_BUYINGGROUPS {
        int buyinggroupid PK
        string buyinggroupname
        int lasteditedby
        datetime validfrom
        datetime validto
    }
    SALES_CUSTOMERCATEGORIES {
        int customercategoryid PK
        string customercategoryname
        int lasteditedby
        datetime validfrom
        datetime validto
    }
    SALES_INVOICELINES {
        int invoicelineid PK
        int invoiceid PK
        int stockitemid
        string description
        int packagetypeid
        int quantity
        float unitprice
        float taxrate
        float taxamount
        float lineprofit
        float extendedprice
        int lasteditedby
        datetime lasteditedwhen
        string invoiceid_stockitemid_packagetypeid
        string invoiceid_invoicelineid
    }
    SALES_ORDERS {
        int orderid PK
        int customerid
        int salespersonpersonid
        int pickedbypersonid
        int contactpersonid
        int backorderorderid
        datetime orderdate
        datetime expecteddeliverydate
        int customerpurchaseordernumber
        boolean isundersupplybackordered
        string comments
        string deliveryinstructions
        string internalcomments
        datetime pickingcompletedwhen
        int lasteditedby
        datetime lasteditedwhen
    }
    SALES_ORDERLINES {
        int orderlineid PK
        int orderid PK
        int stockitemid
        string description
        int packagetypeid
        int quantity
        float unitprice
        float taxrate
        int pickedquantity
        datetime pickingcompletedwhen
        int lasteditedby
        datetime lasteditedwhen
        string orderid_stockitemid_packagetypeid
        string orderid_orderlineid
    }
    %% Module: warehouse
    WAREHOUSE_STOCKITEMS {
        int stockitemid PK
        string stockitemname
        int supplierid
        int colorid
        int unitpackageid
        int outerpackageid
        string brand
        string size
        int leadtimedays
        int quantityperouter
        boolean ischillerstock
        int barcode
        float taxrate
        float unitprice
        float recommendedretailprice
        float typicalweightperunit
        string marketingcomments
        string internalcomments
        string photo
        string customfields
        string tags
        string searchdetails
        int lasteditedby
        datetime validfrom
        datetime validto
    }
    WAREHOUSE_PACKAGETYPES {
        int packagetypeid PK
        string packagetypename
        int lasteditedby
        datetime validfrom
        datetime validto
    }
    WAREHOUSE_STOCKGROUPS {
        int stockgroupid PK
        string stockgroupname
        int lasteditedby
        datetime validfrom
        datetime validto
    }
    WAREHOUSE_COLDROOMTEMPERATURES {
        int coldroomtemperatureid PK
        int coldroomsensornumber
        datetime recordedwhen
        float temperature
        datetime validfrom
        datetime validto
    }
    WAREHOUSE_COLORS {
        int colorid PK
        string colorname
        int lasteditedby
        datetime validfrom
        datetime validto
    }
    WAREHOUSE_STOCKITEMSTOCKGROUPS {
        int stockitemstockgroupid PK
        int stockitemid PK
        int stockgroupid PK
        int lasteditedby
        string lasteditedwhen
        string stockitemid_stockgroupid
    }
    WAREHOUSE_STOCKITEMTRANSACTIONS {
        int stockitemtransactionid PK
        int stockitemid
        int transactiontypeid
        int customerid
        int invoiceid
        int supplierid
        int purchaseorderid
        datetime transactionoccurredwhen
        float quantity
        int lasteditedby
        datetime lasteditedwhen
    }
    WAREHOUSE_STOCKITEMHOLDINGS {
        int stockitemid
        int quantityonhand
        string binlocation
        int laststocktakequantity
        float lastcostprice
        int reorderlevel
        int targetstocklevel
        int lasteditedby
        string lasteditedwhen
    }
    WAREHOUSE_VEHICLETEMPERATURES {
        int vehicletemperatureid PK
        string vehicleregistration
        int chillersensornumber
        datetime recordedwhen
        float temperature
        string fullsensordata
        boolean iscompressed
        string compressedsensordata
    }
    APPLICATION_STATEPROVINCES ||--o{ APPLICATION_CITIES : "stateprovinceid"
    APPLICATION_COUNTRIES ||--o{ APPLICATION_STATEPROVINCES : "countryid"
    WAREHOUSE_PACKAGETYPES ||--o{ PURCHASING_PURCHASEORDERLINES : "packagetypeid"
    WAREHOUSE_STOCKITEMS ||--o{ PURCHASING_PURCHASEORDERLINES : "stockitemid"
    APPLICATION_DELIVERYMETHODS ||--o{ PURCHASING_PURCHASEORDERS : "deliverymethodid"
    PURCHASING_SUPPLIERS ||--o{ PURCHASING_PURCHASEORDERS : "supplierid"
    PURCHASING_SUPPLIERCATEGORIES ||--o{ PURCHASING_SUPPLIERS : "suppliercategoryid"
    APPLICATION_PAYMENTMETHODS ||--o{ PURCHASING_SUPPLIERTRANSACTIONS : "paymentmethodid"
    APPLICATION_TRANSACTIONTYPES ||--o{ PURCHASING_SUPPLIERTRANSACTIONS : "transactiontypeid"
    PURCHASING_SUPPLIERS ||--o{ PURCHASING_SUPPLIERTRANSACTIONS : "supplierid"
    APPLICATION_DELIVERYMETHODS ||--o{ SALES_CUSTOMERS : "deliverymethodid"
    SALES_CUSTOMERCATEGORIES ||--o{ SALES_CUSTOMERS : "customercategoryid"
    APPLICATION_TRANSACTIONTYPES ||--o{ SALES_CUSTOMERTRANSACTIONS : "transactiontypeid"
    SALES_CUSTOMERS ||--o{ SALES_CUSTOMERTRANSACTIONS : "customerid"
    SALES_INVOICES ||--o{ SALES_INVOICELINES : "invoiceid"
    WAREHOUSE_PACKAGETYPES ||--o{ SALES_INVOICELINES : "packagetypeid"
    WAREHOUSE_STOCKITEMS ||--o{ SALES_INVOICELINES : "stockitemid"
    APPLICATION_DELIVERYMETHODS ||--o{ SALES_INVOICES : "deliverymethodid"
    SALES_CUSTOMERS ||--o{ SALES_INVOICES : "customerid"
    WAREHOUSE_PACKAGETYPES ||--o{ SALES_ORDERLINES : "packagetypeid"
    WAREHOUSE_STOCKITEMS ||--o{ SALES_ORDERLINES : "stockitemid"
    SALES_CUSTOMERS ||--o{ SALES_ORDERS : "customerid"
    SALES_BUYINGGROUPS ||--o{ SALES_SPECIALDEALS : "buyinggroupid"
    WAREHOUSE_STOCKGROUPS ||--o{ SALES_SPECIALDEALS : "stockgroupid"
    WAREHOUSE_STOCKITEMS ||--o{ WAREHOUSE_STOCKITEMHOLDINGS : "stockitemid"
    PURCHASING_SUPPLIERS ||--o{ WAREHOUSE_STOCKITEMS : "supplierid"
    WAREHOUSE_STOCKGROUPS ||--o{ WAREHOUSE_STOCKITEMSTOCKGROUPS : "stockgroupid"
    WAREHOUSE_STOCKITEMS ||--o{ WAREHOUSE_STOCKITEMSTOCKGROUPS : "stockitemid"
    APPLICATION_TRANSACTIONTYPES ||--o{ WAREHOUSE_STOCKITEMTRANSACTIONS : "transactiontypeid"
    WAREHOUSE_STOCKITEMS ||--o{ WAREHOUSE_STOCKITEMTRANSACTIONS : "stockitemid"
